# Python Pandas working with Json 
## In Part we are going to learn about
## - 1.read Json(read_json)
## - 2.To Json(to_json)
## - 3.Json Normalize

In [38]:
import pandas as pd

In [23]:
data = '{"anime_name": "Attack on Titan","main_char": "Eren yeager","side_char": [{"char1":"Armin","char2":"Mikasa"}]}'

In [24]:
data

'{"anime_name": "Attack on Titan","main_char": "Eren yeager","side_char": [{"char1":"Armin","char2":"Mikasa"}]}'

In [25]:
type(data)

str

In [26]:
pd.read_json(data)

        anime_name    main_char                              side_char
0  Attack on Titan  Eren yeager  {'char1': 'Armin', 'char2': 'Mikasa'}

In [36]:
pd.read_json(data,orient='records')

        anime_name    main_char                              side_char
0  Attack on Titan  Eren yeager  {'char1': 'Armin', 'char2': 'Mikasa'}

In [37]:
pd.read_json(data,orient='index')

                                                  0
anime_name                          Attack on Titan
main_char                               Eren yeager
side_char   [{'char1': 'Armin', 'char2': 'Mikasa'}]

In [39]:
pd.read_json(data,orient='columns')

        anime_name    main_char                              side_char
0  Attack on Titan  Eren yeager  {'char1': 'Armin', 'char2': 'Mikasa'}

## convert to json

In [41]:
import pandas as pd
df = pd.DataFrame([['a','b'],['d','c']],
                  index=['row1','row2'],
                  columns=['col1','col2'])

In [42]:
df.head()

     col1 col2
row1    a    b
row2    d    c

In [51]:
#convert dataframe into json string
df.to_json()

'{"col1":{"row1":"a","row2":"d"},"col2":{"row1":"b","row2":"c"}}'

In [52]:
df.to_json(orient= 'index')

'{"row1":{"col1":"a","col2":"b"},"row2":{"col1":"d","col2":"c"}}'

In [53]:
df.to_json(orient= 'columns')

'{"col1":{"row1":"a","row2":"d"},"col2":{"row1":"b","row2":"c"}}'

In [54]:
df.to_json(orient= 'records')

'[{"col1":"a","col2":"b"},{"col1":"d","col2":"c"}]'

In [55]:
df.to_json(orient= 'split')

'{"columns":["col1","col2"],"index":["row1","row2"],"data":[["a","b"],["d","c"]]}'

In [56]:
df.to_json(orient= 'table')

'{"schema":{"fields":[{"name":"index","type":"string"},{"name":"col1","type":"string"},{"name":"col2","type":"string"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":"row1","col1":"a","col2":"b"},{"index":"row2","col1":"d","col2":"c"}]}'

In [57]:
schema='{"schema":{"fields":[{"name":"index","type":"string"},{"name":"col1","type":"string"},{"name":"col2","type":"string"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":"row1","col1":"a","col2":"b"},{"index":"row2","col1":"d","col2":"c"}]}'

In [58]:
pd.read_json(schema,orient='table')

     col1 col2
row1    a    b
row2    d    c

## json normalize

In [63]:
data = [{"anime_name": "Attack on Titan","main_char": "Eren yeager","side_char": {"char1":"Armin","char2":"Mikasa"}}]

In [64]:
type(data)

list

In [65]:
pd.json_normalize(data)

        anime_name    main_char side_char.char1 side_char.char2
0  Attack on Titan  Eren yeager           Armin          Mikasa

In [66]:
data = [
    {
        "anime":1,
        "name":"naruto",
        "fitness":{"height": 5.7,"weight":75},
    },
    {"name":"eren","fitness":{"height": 6.1,"weight":78}},
    {
        "anime":2,
        "name":"tanjiro",
        "fitness":{"height": 5.4,"weight":55},
    },
]

In [67]:
pd.json_normalize(data)

   anime     name  fitness.height  fitness.weight
0    1.0   naruto             5.7              75
1    NaN     eren             6.1              78
2    2.0  tanjiro             5.4              55

In [68]:
pd.json_normalize(data,max_level=0)

   anime     name                        fitness
0    1.0   naruto  {'height': 5.7, 'weight': 75}
1    NaN     eren  {'height': 6.1, 'weight': 78}
2    2.0  tanjiro  {'height': 5.4, 'weight': 55}

In [69]:
pd.json_normalize(data,max_level=1)

   anime     name  fitness.height  fitness.weight
0    1.0   naruto             5.7              75
1    NaN     eren             6.1              78
2    2.0  tanjiro             5.4              55

In [101]:
data= [
    {
        "series":"dark",
        "season":3,
        "about":{"time":"Time travel"},
        "travel":[
            {"year":"early 90s","char_age":19},
            {"year":"mid 80s","char_age":72},
            {"year":"early 80s","char_age":35},
        ],
    },
    {
       "series":"13 reason",
        "season":1,
        "about":{"time":"death reasons"},
        "travel":[
            {"year":2018,"char_age":19},
            {"year":2019,"char_age":19},
            {"year":2018,"char_age":20},
        ], 
    },
]

In [95]:
pd.json_normalize(data)

,series,season,travel,about.time,about.life
0,dark,3,"[{'year': 'early 90s', 'char_age': 19}, {'year...",Time travel,NaN
1,13 reason,1,"[{'year': 2018, 'char_age': 19}, {'year': 2019...",NaN,death reasons

In [96]:
pd.json_normalize(data,"travel")

        year  char_age
0  early 90s        19
1    mid 80s        72
2  early 80s        35
3       2018        19
4       2019        19
5       2018        20

In [100]:
pd.json_normalize(data,"travel",["series","season","about"])

        year  char_age     series season                      about
0  early 90s        19       dark      3    {'time': 'Time travel'}
1    mid 80s        72       dark      3    {'time': 'Time travel'}
2  early 80s        35       dark      3    {'time': 'Time travel'}
3       2018        19  13 reason      1  {'life': 'death reasons'}
4       2019        19  13 reason      1  {'life': 'death reasons'}
5       2018        20  13 reason      1  {'life': 'death reasons'}

In [102]:
pd.json_normalize(data,"travel",["series","season",["about","time"]])

        year  char_age     series season     about.time
0  early 90s        19       dark      3    Time travel
1    mid 80s        72       dark      3    Time travel
2  early 80s        35       dark      3    Time travel
3       2018        19  13 reason      1  death reasons
4       2019        19  13 reason      1  death reasons
5       2018        20  13 reason      1  death reasons